In [17]:
a=[1,2.5,"hello",4]
#Series=1D
import pandas as pd
sr=pd.Series(a)
sr
# slicing of series 
sr[1:3]
sr[0:]
sr[:2]


# indexing
sr[3]
sr[2]

'hello'

In [26]:
a=[[1,2,3],[3,4,5]]
df=pd.DataFrame(a,columns=["col1","col2","col3"],dtype=float,index=[5,6])
df


# to access 1 column from dataframe 
df["col1"]

# to access multiple columns
df[["col1","col3"]]

# slicing of dataframe 
df.iloc[:,1:3]


df.loc[:,:"col2"]
#df

   col1  col2
5   1.0   2.0
6   3.0   4.0

In [27]:
di={"col1":[1,2,3,3,4,5,6,6],"col2":[1,2,3,3,4,5,6,6],"col3":[1,2,3,3,4,5,6,6],"col4":[1,2,3,3,4,5,6,6]}

In [30]:
df=pd.DataFrame(di)
df.shape# row and column of dataframe
df

   col1  col2  col3  col4
0     1     1     1     1
1     2     2     2     2
2     3     3     3     3
3     3     3     3     3
4     4     4     4     4
5     5     5     5     5
6     6     6     6     6
7     6     6     6     6

In [35]:
df.iloc[1:6,1:]
df.loc[1:6,"col2":]


# to access odd index records
df.loc[1::2,["col2","col3","col4"]]
df.iloc[1::2,1:]

df.iloc[[1,3,5,7],1:]

   col2  col3  col4
1     2     2     2
3     3     3     3
5     5     5     5
7     6     6     6

True
False

True

In [5]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]

BabyDataSet = list(zip(names,births))
print(BabyDataSet)


df = pd.DataFrame(data = BabyDataSet)
print(df)

df.to_csv('file1.csv')

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]
         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973

In [7]:
dff=pd.read_csv("file1.csv")
dff


# to fetch the column from dataframe 
#dff["Names"]


#df[0]


# drop the column from dataframe 

ddd=dff.drop(["Unnamed: 0"],axis=1)
ddd

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973